tutorials/compressible/sonicFoam/shockTube/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="sonicFoam"

runApplication blockMesh
runApplication setFields
runApplication $application
runApplication foamCalc mag U
runApplication sample
